/** 各种正则表达式 */
export const Reg = {
    /** 手机号正则 */
    phone: /^1(3\d|4[5-9]|5[0-35-9]|6[567]|7[0-8]|8\d|9[0-35-9])\d{8}$/,

    /** rgb 颜色正则 */
    rgb: /rgba?\(\s*(\d+)\s*,\s*(\d+)\s*,\s*(\d+)\s*(?:,\s*([\d\.]+))?\s*\)/,

    /** 身份证正则 */
    cardId: /^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,

    /** 中文正则 */
    chinese: /[\u4e00-\u9fa5]/,

    /** 
     * 数字转千分位正则
     * @example
     * "123456789".replace(Reg.numToLocaleString, ",")
     */
    numToLocaleString: /\B(?=(?:\d{3})+$)/g,
    
    /** 密码校验正则：必须包含数字、大小写字母、特殊字符，6-12 位 */
    pwd: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*\W).{6,12}$/,
}

/** 一整天的毫秒 */
export const ONE_DAY = 1000 * 60 * 60 * 24
/** 检查是否是 Node 环境 */
export const isNode = typeof window === 'undefined'
